Repository: nevma/nvm-donor
Catalog: languages/nevma-donor-*.po
Languages: el

source: Sorry, but this plugin requires the WooCommerce plugin to be active.
el: Συγνώμη, αλλά αυτό το πρόσθετο απαιτεί το WooCommerce να είναι ενεργό.

source: Return to Plugins.
el: Επιστροφή στα Πρόσθετα.

source: Donor Product
el: Προϊόν Δωρητή

source: Donation Options
el: Επιλογές Δωρεάς

source: Price Α
el: Τιμή Α

source: Price B
el: Τιμή Β

source: Price C
el: Τιμή Γ

source: Price D
el: Τιμή Δ

source: Texts after the Donation
el: Κείμενα μετά τη Δωρεά

source: Optional message from the donor.
el: Προαιρετικό μήνυμα από τον δωρητή.

source: Enter a message for the donation...
el: Εισάγετε ένα μήνυμα για τη δωρεά...

source: Minimum Donation Amount
el: Ελάχιστο Ποσό Δωρεάς

source: Set the minimum donation amount.
el: Ορίστε το ελάχιστο ποσό δωρεάς.

source: We are sorry, but you can only have one Donation in your cart. View your cart <a href="%s">εδώ</a>.
el: Συγνώμη, αλλά μπορείτε να έχετε μόνο μία Δωρεά στο καλάθι σας. Δείτε το καλάθι σας <a href="%s">εδώ</a>.

source: INDIVIDUAL
el: ΙΔΙΩΤΗΣ

source: CORPORATE
el: ΕΤΑΙΡΕΙΑ

source: IN MEMORY
el: ΕΙΣ ΜΝΗΜΗ

source: Other Amount
el: Άλλο Ποσό

source: Add the Amount / Minimum
el: Προσθέστε το Ποσό / Ελάχιστο

source: Company Information
el: Πληροφορίες Εταιρείας

source: Company Name
el: Όνομα Εταιρείας

source: Tax ID (AFM)
el: ΑΦΜ

source: Tax Office (DOY)
el: ΔΟΥ

source: Headquarters Address
el: Διεύθυνση Έδρας

source: Donor Information
el: Πληροφορίες Δωρητή

source: Company Representative Information
el: Πληροφορίες Εκπροσώπου Εταιρείας

source: "In Memory" Donation Information
el: Πληροφορίες Δωρεάς "Εις Μνήμη"

source: First Name
el: Όνομα

source: Last Name
el: Επώνυμο

source: Address
el: Διεύθυνση

source: City
el: Πόλη

source: Postal Code
el: Ταχυδρομικός Κώδικας

source: Phone Number
el: Τηλέφωνο

source: Full name of the deceased
el: Πλήρες όνομα του αποθανόντος

source: Do you wish to notify someone
el: Θέλετε να ειδοποιήσετε κάποιον

source: Name of the deceased's relative
el: Όνομα του συγγενούς του αποθανόντος

source: Message
el: Μήνυμα

source: Would you like to notify the relative?
el: Θέλετε να ειδοποιήσετε τον συγγενή;

source: Relative's First Name
el: Όνομα Συγγενούς

source: Relative's Last Name
el: Επώνυμο Συγγενούς

source: Relative's Email
el: Email Συγγενούς

source: Is the "In Memory" donation made on behalf of a company?
el: Η δωρεά "Εις Μνήμη" γίνεται εκ μέρους εταιρείας;

source: Complete Donation
el: Ολοκλήρωση Δωρεάς

source: Please add a payment amount (minimum %s€).
el: Παρακαλώ προσθέστε ένα ποσό πληρωμής (ελάχιστο %s€).

source: The field "%s" is required.
el: Το πεδίο "%s" είναι υποχρεωτικό.

source: Email is required.
el: Το email είναι υποχρεωτικό.

source: Name is required.
el: Το όνομα είναι υποχρεωτικό.

source: Surname is required.
el: Το επώνυμο είναι υποχρεωτικό.

source: Product ID is required
el: Απαιτείται το ID του προϊόντος

source: Invalid donor product
el: Μη έγκυρο προϊόν δωρητή
